import { Component } from '@angular/core';
import { NavController } from 'ionic-angular';
import { InfoPage } from '../info/info';

interface ImgPuzzle {
  name: string,
  url: string,
  introduce: string
}

@Component({
  selector: 'page-home',
  templateUrl: 'home.html',
})
export class HomePage {

  private items: Array<ImgPuzzle> = [];

  constructor(public navCtrl: NavController) {
    this.items.push({
      name: '铃仙·优昙华院·因幡', url: 'assets/imgs/a1.jpg', introduce:
      "铃仙·优昙华院·因幡是只和其它妖兽气质大不相同的妖怪兔。她身体修长，步姿端正，不像妖兽。在妖兽之中算是活动缓慢。虽是妖兽，却从不袭击人类。相反会避开人类。有着很长耳朵和头发。总的来说，是只与众不同的妖怪兔。<br/>" +
      "<br/>" +
      "据说一直看着她的红眼会让人发狂，而且她的声音，要听也听不进去，相反在远处有时会听到在耳边说话。因为这么让人厌恶，几乎无法和她对话。<br/>" +
      "<br/>" +
      "平时住在永远亭，在那里行动不明。有时也会来村庄售药。带着一堆怪药出现在村庄是出了名的（例如一些很苦的药）<br/>" +
      "<br/>" +
      "名片<br/>" +
      "原名：鈴仙·優曇華院·イナバ （レイセン・うどんげいん・イナバ，Reisen Udongein Inaba，铃仙·优昙华院·因幡）<br/>" +
      "<br/>" +
      "昵称：大兔子、铃仙<br/>" +
      "<br/>" +
      "种族：月兔<br/>" +
      "<br/>" +
      "住所：永远亭<br/>" +
      "<br/>" +
      "职业：辉夜的宠物、永琳的学徒<br/>" +
      "<br/>" +
      "能力：操纵波长程度的能力<br/>" +
      "<br/>" +
      "萌属性：兔娘、兔耳、兔尾、红瞳<br/>" +
      "<br/><br/>"
    });
    this.items.push({
      name: '博丽灵梦', url: 'assets/imgs/a2.jpg', introduce:
      "《东方Project》的主角，几乎在每一作之中均有出现。<br/>" +
      "<br/>" +
      "博丽神社的巫女，名义上的幻想乡管理者。<br/>" +
      "<br/>" +
      "天生拥有不可思议的幸运和敏锐，以及许多能力，不过修行不足。<br/>" +
      "<br/>" +
      "不相信努力会有回报，讨厌修炼，缺乏危机感。<br/>" +
      "<br/>" +
      "每天就是在神社里面打扫和悠闲地喝茶。<br/>" +
      "<br/>" +
      "不过每次一旦发生异变，就会急急忙忙赶着去调查。<br/>" +
      "<br/>" +
      "退治妖怪的时候会非常严厉，但是在没有工作需要的时候对妖怪人类也是一视同仁。<br/>" +
      "<br/>" +
      "符卡多以“结界”、“阴阳”、“封印”等为主题。<br/>" +
      "<br/>" +
      "代表形象为阴阳玉，武器是阴阳玉和符纸。<br/>" +
      "<br/>" +
      "常见的二次设定有贪钱（一设里也有一定程度）、无节操等等。<br/>" +
      "<br/>" +
      "名片<br/>" +
      "原名：博麗 霊夢（はくれい れいむ，Hakurei Reimu，博丽灵梦）<br/>" +
      "<br/>" +
      "昵称：无节操，红白，城管<br/>" +
      "<br/>" +
      "年龄：大约是少女的年龄<br/>" +
      "<br/>" +
      "种族：人类<br/>" +
      "<br/>" +
      "住所：博丽神社<br/>" +
      "<br/>" +
      "职业：巫女<br/><br/>"
    });
    this.items.push({
      name: '比那名居天子', url: 'assets/imgs/a3.jpg', introduce:
      "居住在天界的天人，比那名居一族的大小姐。<br/>" +
      "<br/>" +
      "能够镇压和引发地震，并能操纵要石和使用绯想之剑。<br/>" +
      "<br/>" +
      "性格我行我素。<br/>" +
      "<br/>" +
      "因为对天界的生活感到无聊，于是引发了异变。" +
      "<br/><br/>" +
      "原名：比那名居 地子(ひななゐ ちこ，Hinanawi Chiko)→比那名居 天子(ひななゐ てんし，Hinanawi Tenshi)<br/>" +
      "<br/>" +
      "昵称：Momoko（桃子）、M子<br/>" +
      "<br/>" +
      "年龄：<br/>" +
      "<br/>" +
      "种族：人类→天人(不良天人)<br/>" +
      "<br/>" +
      "身高：较高<br/>" +
      "<br/>" +
      "住所：幻想乡→有顶天<br/>" +
      "<br/>" +
      "职业：<br/>" +
      "<br/>" +
      "能力：操纵大地程度的能力<br/>" +
      "<br/>" +
      "萌属性：大小姐、蓝发、红瞳、桃子饰品的帽子"
    });
    this.items.push({
      name: '八云紫', url: 'assets/imgs/a4.jpg', introduce:
      "资历和力量非常强大，有极高的智力，总是了解一切的样子。她被称为妖怪贤者，千年前幻想乡的创始人之一。作为少数知道幻想乡本质的妖怪，对幻想乡也极端地珍爱。<br/>" +
      "<br/>" +
      "她的主要活动时间是傍晚到半夜，白天则一直睡觉，一天能睡12个小时，因此可以说是除傍晚到半夜以外都不活动......属于典型的妖怪。她说她会在冬天冬眠（冬眠前存贮人类），春天醒来。不过由于不知道她冬天一直在哪里，所以无法判断真伪。<br/>" +
      "<br/>" +
      "她基本上不会自己动手，所有杂事都会推给她的妖兽式神八云蓝。尤其是白天和冬季，紫在睡觉的时候，会把事情都交给式神处理，这只式神会代理紫的一切行动。有时候也会用很特别的方法关心式神。<br/>" +
      "<br/>" +
      "还有就是她有好多同是活了好久的妖怪朋友。栖宿在冥界的西行寺幽幽子、鬼之伊吹萃香等等。她的朋友几乎都是些最强等级的妖怪。可是跟风见幽香除了经常战斗外没什么特别的关系（二设）。友人全是万年萝莉（萝莉控无误）。但是因为其无法理解的性格导致除了博丽灵梦，一般没有人会认真和她相处<br/>" +
      "<br/>" +
      "似乎和在现世的人类秘封俱乐部成员玛艾露贝莉·赫恩有类似庄生梦蝶的关系。<br/>" +
      "<br/>" +
      "弹幕名多以相对事物为主题。<br/>" +
      "<br/>" +
      "隙间妖怪， 这一种族只由她一人组成，平常都待在她的隙间里面。<br/>" +
      "<br/>" +
      "两次月面战争的发动者。<br/>" +
      "<br/><br/>" +
      "原名：八云 紫（やくも ゆかり，Yakumo Yukari，八云紫）<br/>" +
      "<br/>" +
      "昵称：紫妈、紫大人、永远的十七岁、紫妹<br/>" +
      "<br/>" +
      "年龄：17岁又N个月其实至少1200..anghhkjl;l'klhjhgfsdfhjkl;' lkhjfcxsdffhjkhl;lkjhgfsdhjkl;l<br/>" +
      "<br/>" +
      "种族：隙间妖怪（紫是一个人一个种族的角色）<br/>" +
      "<br/>" +
      "身高：较高<br/>" +
      "<br/>" +
      "住所：她的家和博丽神社一样，建立在幻想乡和外面世界之间的境界上，没人见过那建筑物的样子，有人说她的家在外面的世界。<br/>" +
      "<br/>" +
      "职业：妖怪贤闲咸者<br/>" +
      "<br/>" +
      "能力：操纵境界的能力<br/>" +
      "<br/>" +
      "萌属性：伞、扇子、金发、御姐、金瞳、紫瞳、永远的十七岁<br/>" +
      "<br/><br/>"
    });
    this.items.push({
      name: '古明地觉', url: 'assets/imgs/a5.jpg', introduce:
      "古明地觉是地灵殿的主人、古明地恋的姐姐，拥有读心的能力。<br/>" +
      "<br/>" +
      "同时是地底都市遗迹里残留着的怨灵的管理者。<br/>" +
      "<br/>" +
      "在灼热地狱遗址上建立起了地灵殿，并在那里居住了下来。<br/>" +
      "<br/>" +
      "因为她能够读取他人心中的想法，在她的面前没有秘密可言。<br/>" +
      "<br/>" +
      "不管是任何妖怪，连怨灵都为之感到恐惧。<br/>" +
      "<br/>" +
      "但是，相反因为能读心而受到那些不会说话的动物们的喜爱。<br/>" +
      "<br/>" +
      "因为宠物的增多，导致灼热地狱遗迹无法完美的管理，最后只得把很多管理事项交由宠物们去做。<br/>" +
      "<br/>" +
      "代表形象是“觉之眼”。<br/>" +
      "<br/>" +
      "符卡多以“回忆”或“心理活动”作为主题。<br/>" +
      "<br/><br/>" +
      "原名：古明地さとり（こめいじさとり，Komeiji Satori，古明地觉）<br/>" +
      "<br/>" +
      "昵称：小五、小五萝莉、⑤<br/>" +
      "<br/>" +
      "种族：妖怪（觉）<br/>" +
      "<br/>" +
      "身高：偏矮<br/>" +
      "<br/>" +
      "住所：地灵殿<br/>" +
      "<br/>" +
      "能力：可以读心程度的能力<br/>" +
      "<br/>" +
      "萌属性：姐姐、紫发、水手袜、万年萝莉" +
      "<br/><br/>"
    });
    this.items.push({
      name: '帕秋莉·诺蕾姬', url: 'assets/imgs/a6.jpg', introduce:
      "帕秋莉是居住于红魔馆的魔法使。<br/>" +
      "<br/>" +
      "她是大小姐蕾米莉亚的好朋友，是个大概有100岁的魔女。<br/>" +
      "<br/>" +
      "居住在幻想乡中藏书最多的大图书馆——红魔馆地下图书馆中。<br/>" +
      "<br/>" +
      "喜欢读书，并且会使用七曜魔法。<br/>" +
      "<br/>" +
      "她平常总待在大图书馆里，患有哮喘、贫血，体质虚弱，因此在肉搏战中非常劣势。<br/>" +
      "<br/>" +
      "身体能力比人类还弱，不过她压倒性的魔法攻击可以弥补这一点。<br/>" +
      "<br/>" +
      "她无论什么时候都拿着书，并将书视为自己的一部分，离开书便无法生活。<br/>" +
      "<br/>" +
      "其符卡多数以七曜作为符名。<br/>" +
      "<br/><br/>" +
      "原名：パチュリー・ノーレッジ（Patchouli Knowledge，帕秋莉・诺蕾姬）<br/>" +
      "<br/>" +
      "昵称：姆Q，帕琪<br/>" +
      "<br/>" +
      "年龄：大于一百岁<br/>" +
      "<br/>" +
      "种族：魔女、魔法使<br/>" +
      "<br/>" +
      "《萃梦想》、《绯想天》中为魔女，《地灵殿》、《求闻史纪》中为魔法使<br/>" +
      "此处的魔法使不同于魔理沙，指的是种族而非职业，是妖怪的一种<br/>" +
      "住所：红魔馆地下的大图书馆里<br/>" +
      "<br/>" +
      "职业：魔法使<br/>" +
      "<br/>" +
      "萌属性：紫发，宅女<br/>" +
      "<br/><br/>"
    });
    this.items.push({
      name: '蕾米莉亚·斯卡雷特', url: 'assets/imgs/a7.jpg', introduce:
      "蕾米莉亚是500岁的吸血鬼领主，夜之王。<br/>" +
      "<br/>" +
      "她是红魔馆的主人，芙兰朵露的姐姐。<br/>" +
      "<br/>" +
      "萝莉体型，身穿粉红色的洋装。<br/>" +
      "<br/>" +
      "作为红魔馆的主人，和一般的贵族一样注重威严和体面。<br/>" +
      "<br/>" +
      "但性格却跟外表一样，非常任性和孩子气。<br/>" +
      "<br/>" +
      "她拥有“操纵命运程度的能力”，似乎会使被影响者有很高概率遇上珍奇的事。<br/>" +
      "<br/>" +
      "符卡多以红色为主题。<br/>" +
      "<br/><br/>" +
      "原名：レミリア·スカーレット（Remilia Scarlet，Remiria-Sukāretto，蕾米莉亚·斯卡蕾特）<br/>" +
      "<br/>" +
      "昵称：蕾咪（レミィ）、大小姐、姐姐、蕾米莉亚·抱头蹲防·斯卡蕾特<br/>" +
      "<br/>" +
      "年龄：500岁以上<br/>" +
      "<br/>" +
      "种族：吸血鬼、恶魔<br/>" +
      "<br/>" +
      "身高：矮（ZUN描述：比10岁孩子的身高还低）<br/>" +
      "<br/>" +
      "住所：红魔馆<br/>" +
      "<br/>" +
      "能力：<br/>" +
      "<br/>" +
      "運命を操る程度の能力\t　操纵命运程度的能力<br/>" +
      "萌属性：萝莉、腹黑、傲娇、大小姐、抱头蹲防<br/>" +
      "<br/><br/>"
    });
    this.items.push({
      name: '蓬莱山辉夜', url: 'assets/imgs/a8.jpg', introduce:
      "辉夜原本是生活在月宫的公主。因为利用自己的能力让八意永琳制作出不死之药——蓬莱之药，并服用了，因而触犯禁忌而被流放到地面上。她感到了对曾在地上照顾过她的人类们的依恋与感恩，以及回到月球后可能的种种不便。同时月的使者的首领八意永琳因为对辉夜心怀愧疚，并且深知辉夜回到月球也不能正常生活（沾染了人间的污秽），于是背叛了月都，背叛了同行的使者救下了辉夜。并在这片竹林里设下了永远亭这个居所（由辉夜对永远亭使用了永远的魔法），二人过着隐居的生活。<br/>" +
      "<br/>" +
      "直到永夜异变的夜晚，地面的人类和妖怪打进了永远亭。辉夜看到了地上的人类妖怪之间互相协助亲密无间十分融洽，并感到十分羡慕。同时觉得自己躲躲藏藏的生活愚蠢至极。于是她撤掉了永远的魔法，并且开放了永远亭与外界的联系。并且积极的融入到幻想乡之中。<br/>" +
      "<br/><br/>" +
      "原名：蓬莱山輝夜（ほうらいさん かぐや，Houraisan Kaguya，蓬莱山辉夜）<br/>" +
      "<br/>" +
      "昵称：NEET姬、蓬莱NEET、蓬莱山家具屋、蓬莱山赫映<br/>" +
      "<br/>" +
      "年龄：不老不死（有一说为酒醉后的ZUN曾提过，辉夜与永琳的年龄以亿为单位）<br/>" +
      "<br/>" +
      "种族：月人(《文花帖》中自称人类 )<br/>" +
      "<br/>" +
      "身高：中等<br/>" +
      "<br/>" +
      "住所：永远亭<br/>" +
      "<br/>" +
      "能力：<br/>" +
      "<br/>" +
      "永遠と須臾を操る能力\t　操纵永远和须臾程度的能力<br/>" +
      "萌属性：公主、不老不死、黑长直、腹黑（二设）<br/>" +
      "<br/><br/>"
    });
    this.items.push({
      name: '洩矢诹访子', url: 'assets/imgs/a9.jpg', introduce:
      "守矢神社真正供奉的神明<br/>" +
      "<br/>" +
      "在遠古時候擁有非常恐怖的信仰心，作為神的同時甚至作為王建立了一個王國<br/>" +
      "<br/>" +
      "因為在和神奈子的戰鬥中敗北而投降，將王國交出<br/>" +
      "<br/>" +
      "不過因為神奈子無法得到王國人們的信仰，而變成了在神奈子背後一起治理著王國的情況<br/>" +
      "<br/>" +
      "隨著時間的流逝，諏訪子漸漸的被人們所遺忘，記得諏訪子真名的人，也幾乎沒有了<br/>" +
      "<br/>" +
      "此時神奈子決定將守矢神社遷到幻想鄉內，從此諏訪子在幻想鄉內開始了新的生活<br/>" +
      "<br/>" +
      "諏訪子是早苗遙遠的祖先，不過早苗對此卻完全不知情<br/>" +
      "<br/><br/>" +
      "名字：洩矢諏訪子（もりや すわこ，Moriya Suwako，洩矢諏訪子）<br/>" +
      "<br/>" +
      "種族：神明（土著神）<br/>" +
      "<br/>" +
      "能力：創造坤（地）程度的能力<br/>" +
      "<br/>" +
      "年齡：不詳，推算約有2000年以上<br/>" +
      "<br/>" +
      "身高：較矮<br/>" +
      "<br/>" +
      "住所：守矢神社<br/>" +
      "<br/>" +
      "職業：神明<br/>" +
      "<br/>" +
      "萌點：蘿莉" +
      "<br/><br/>"
    });
    this.items.push({
      name: '月球一家', url: 'assets/imgs/a10.jpg', introduce:
      "这本来应该是一个平静安宁的夜晚。<br/>" +
      "时值幻想乡的满月之夜，月亮和平常看起来没有什么不同。<br/>" +
      "可是，看似完整的满月，却似乎不是真实的。<br/>" +
      "对于人类来说，月亮是不是真实的，没有什么太大的影响。<br/>" +
      "可是对于依赖满月的力量的妖怪们来说，没有满月，就意味失去力量，这可是攸关生死的问题。<br/>" +
      "“这是异变”，幻想乡的妖怪们如此判定着，纷纷找上了人类作为自己的搭档出发调查。<br/>" +
      "为了解决异变和取回满月，人类和妖怪联手将夜晚——停止了。<br/>" +
      "于是，这个晚上，就成为了——永夜。<br/>" +
      "<br/>"
    });
  }

  info(item: ImgPuzzle) {
    this.navCtrl.push(InfoPage, {
      item: item
    });
  }
}
